taskt/Core/Automation/Commands/ExcelGroup/IExcelRowRangeGetProperties.dot
digraph "taskt.Core.Automation.Commands.IExcelRowRangeGetProperties" {
    rankdir="TB";
    node [
        shape="box",
        fontname="Meiryo UI",
        fontsize="12pt"
    ];

"taskt.Core.Automation.Commands.IExcelRowRangeGetProperties" [ label="IExcelRowRangeGetProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.IExcelRowRangeProperties" [ label="IExcelRowRangeProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.IExcelRangeGetProperties" [ label="IExcelRangeGetProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.IExcelRCRangeProperties" [ label="IExcelRCRangeProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.IExpandableProperties" [ label="IExpandableProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.IExcelInstanceProperties" [ label="IExcelInstanceProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.IExcelRCValueTypeProperties" [ label="IExcelRCValueTypeProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.IExcelValueTypeProperties" [ label="IExcelValueTypeProperties", shape="ellipse", style="dashed", ];

"taskt.Core.Automation.Commands.IExcelRowRangeGetProperties" -> "taskt.Core.Automation.Commands.IExcelRowRangeProperties";
"taskt.Core.Automation.Commands.IExcelRowRangeGetProperties" -> "taskt.Core.Automation.Commands.IExcelRangeGetProperties";
"taskt.Core.Automation.Commands.IExcelRowRangeProperties" -> "taskt.Core.Automation.Commands.IExcelRCRangeProperties";
"taskt.Core.Automation.Commands.IExcelRangeGetProperties" -> "taskt.Core.Automation.Commands.IExpandableProperties";
"taskt.Core.Automation.Commands.IExcelRCRangeProperties" -> "taskt.Core.Automation.Commands.IExcelInstanceProperties";
"taskt.Core.Automation.Commands.IExcelRCRangeProperties" -> "taskt.Core.Automation.Commands.IExcelRCValueTypeProperties";
"taskt.Core.Automation.Commands.IExcelInstanceProperties" -> "taskt.Core.Automation.Commands.IExpandableProperties";
"taskt.Core.Automation.Commands.IExcelRCValueTypeProperties" -> "taskt.Core.Automation.Commands.IExcelValueTypeProperties";
"taskt.Core.Automation.Commands.IExcelValueTypeProperties" -> "taskt.Core.Automation.Commands.IExpandableProperties";
}
